src/test/resources/calculate-tax-and-total/respos-api-valid-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/">
  <ns0:Body>
    <ns1:CalculateTransactionTotals xmlns:ns1="http://schemas.micros.com/RESPOS">
      <ns1:ppMenuItems>
        <ns1:ResPosAPI_MenuItem>
          <ns1:MenuItem>
            <ns1:MiObjectNum>20044</ns1:MiObjectNum>
            <ns1:MiMenuLevel>4</ns1:MiMenuLevel>
            <ns1:ItemDiscount>
              <ns1:DiscReference>1</ns1:DiscReference>
            </ns1:ItemDiscount>
          </ns1:MenuItem>
          <ns1:Condiments>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9001103</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9066105</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9001103</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9061203</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9001103</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
            <ns1:ResPosAPI_MenuItemDefinition>
              <ns1:MiObjectNum>9037002</ns1:MiObjectNum>
              <ns1:MiMenuLevel>1</ns1:MiMenuLevel>
              <ns1:MiReference/>
            </ns1:ResPosAPI_MenuItemDefinition>
          </ns1:Condiments>
        </ns1:ResPosAPI_MenuItem>
        <ns1:ResPosAPI_MenuItem>
          <ns1:MenuItem>
            <ns1:MiObjectNum>80020</ns1:MiObjectNum>
            <ns1:MiMenuLevel>4</ns1:MiMenuLevel>
            <ns1:ItemDiscount>
              <ns1:DiscReference>1</ns1:DiscReference>
            </ns1:ItemDiscount>
          </ns1:MenuItem>
          <ns1:Condiments/>
        </ns1:ResPosAPI_MenuItem>
      </ns1:ppMenuItems>
      <ns1:pSubtotalDiscount>
        <ns1:DiscObjectNum>3684</ns1:DiscObjectNum>
        <ns1:DiscAmountOrPercent>3.13</ns1:DiscAmountOrPercent>
      </ns1:pSubtotalDiscount>
      <ns1:revenueCenter>5</ns1:revenueCenter>
      <ns1:orderType>5</ns1:orderType>
      <ns1:employeeNumber>98008</ns1:employeeNumber>
    </ns1:CalculateTransactionTotals>
  </ns0:Body>
</ns0:Envelope>